controllers/NewsController.php

SELECT * FROM `news` WHERE `id`='1'
SELECT * FROM `news` WHERE (`section_id`='1') AND (`id`<>'1') LIMIT 5
---
    public function actionPost(){
    	$this->view->title = 'Отдельная новость';

        $post_id = Yii::$app->request->get('post_id');
        // echo '<pre>' . print_r($post_id, true) . '</pre>';
        $post = News::find()->where(['id' => $post_id])->one();
        $section_id = Yii::$app->request->get('name');
        // echo '<pre>' . print_r($section_id, true) . '</pre>';
        $name = News::find()->where(['section_id' => $section_id])->andWhere(['not in','id',$post_id])->limit(5)->all();

SELECT * FROM `news` WHERE `title` LIKE '%до%'
---
    public function actionSearch(){
        $user_query = Yii::$app->request->get('q');
        // $query = "SELECT * FROM news, sections where news.section_id = sections.id";
        // $results = News::find()->where(['section_id' => $user_query])->all();

        $results = News::find()->where(['like', 'title', $user_query])->all();